
<!--<html>-->
<!--<body>-->
<!--<form method="GET" >-->
<!--    Variable a: <input type="text" name="name_a" >-->
<!--    <input type="submit" value="Отправить">-->
<!--</form>-->
<!--</body>-->
<?php
//$a= $_GET['name_a'];
//if ($a=='test'){
//    echo "YES,var a=".$a;
//}
//else{
//    echo "NO";
//}
//
//?>
<!--</body>-->
<!--</html>-->

<!--2я задача-->

<!--<html>-->
<!--<body>-->
<!--<form method="GET" >-->
<!--    Variable a: <input type="text" name="name_a" >-->
<!--    <input type="submit" value="Отправить">-->
<!--</form>-->
<!--</body>-->
<?php
//$a= $_GET['name_a'];
//if ($a==0||2){
//    echo $a+7;
//}
//else{
//    echo $a/10;
//}
//
//?>
<!--</body>-->
<!--</html>-->

<!--переменной $min лежит число от 0 до 59. Определите в какую четверть часа-->
<!--попадает это число (в первую, вторую, третью или четвертую).-->
<!--Затем переделать эту задачу -->
<!--<html>-->
<!--<body>-->
<!--<form method="GET" >-->
<!--    Введите число: <input type="text" name="minute" >-->
<!--    <input type="submit" value="Отправить">-->
<!--</form>-->
<!--</body>-->
<?php
//$min= $_GET['minute'];
//if ($min<16 )
//{
//    echo "1я четверть часа";
//}
//elseif ($min>16 && $min<=30 )
//{
//    echo "2я четверть часа";
//}
//elseif ($min>30 && $min<=45 )
//{
//    echo "3я четверть часа";
//}
//elseif ($min>45 && $min<=59 )
//{
//    echo "4я четверть часа";
//
//}
//else echo "введите число от 0 до 59"
//?>
<!--</body>-->
<!--</html>-->

<!--В переменной $month лежит какое-то число из интервала от 1 до 12. Определите в-->
<!--какую пору года попадает этот месяц (зима, лето, весна, осень). Затем переделать-->
<!--эту задачу считывая число из формы.-->
<!--<html>-->
<!--<body>-->
<!--<form method="GET" >-->
<!--    Введите номер месяца: <input type="text" name="month" >-->
<!--    <input type="submit" value="Отправить">-->
<!--</form>-->
<!--</body>-->
<?php
//$month= $_GET['month'];
//if ($month<=2 || $month==12 )
//{
//    echo "Зимний месяц";
//}
//elseif ($month>2 && $month<=5)
//{
//    echo "Весенний месяц";
//}
//elseif ($month>5 && $month<=8 )
//{
//    echo "Летний месяц";
//}
//elseif ($month>8 && $month<=11 )
//{
//    echo "Осенний месяц";
//
//}
//elseif ($month==0)
//{
//    echo "введите число от 1 до 12";
//}
//else echo "введите число от 1 до 12";
//?>
<!--</body>-->
<!--</html><html>-->
<!--<body>-->
<!--<form method="GET" >-->
<!--    Введите номер месяца: <input type="text" name="month" >-->
<!--    <input type="submit" value="Отправить">-->
<!--</form>-->
<!--</body>-->
<?php
//$month= $_GET['month'];
//if ($month<=2 || $month==12 )
//{
//    echo "Зимний месяц";
//}
//elseif ($month>2 && $month<=5)
//{
//    echo "Весенний месяц";
//}
//elseif ($month>5 && $month<=8 )
//{
//    echo "Летний месяц";
//}
//elseif ($month>8 && $month<=11 )
//{
//    echo "Осенний месяц";
//
//}
//else echo "введите число от 1 до 12";
//?>
<!--</body>-->
<!--</html>-->

<!--В переменной $year хранится год. Определите, является ли он високосным (в таком-->
<!--году есть 29 февраля). Год будет високосным в двух случаях: либо он делится на 4,-->
<!--но при этом не делится на 100, либо делится на 400.-->
<?php
//$year = 2016;
//if ($year % 4 == 0 or ($year % 400 == 0 and $year & 100 != 0))
//{
//    echo 'Этот год високосный';
//}
//else
//    {
//    echo 'Не високосный год';
//}
//?>

<!--Ввести оценки ученика по 5ти предметам. Посчитать средний балл и перевести его-->
<!--в словарный эквивалент. Например 0-30 – выгнать, 30-60 не зачёт, 60-74 –-->
<!--удовлетворительно, 75-89 – хорошо, 90-100 – отлично.-->
<?php
//$math=50;
//$eng=50;
//$history=50;
//$biology=50;
//$physic=200;
//$grade=($math+$eng+$history+$biology+$physic)/5;
//if ($grade<=30)
//{
//    echo 'выгнать';
//}
//elseif ($grade>30 and $grade<=60)
//{
//    echo 'не зачет';
//}
//elseif ($grade>60 and $grade<=74)
//{
//    echo 'удовлетворительно';
//}
//elseif ($grade>74 and $grade<=89)
//{
//    echo 'хорошо';
//}
//elseif ($grade>89 and $grade<=100)
//{
//    echo 'отлично';
//}
//else echo 'что то не так';

//Дано целое число, лежащее в диапазоне 1-999. Вывести его строку описание вида
//«четное двузначное число», «нечетное трехзначное число» и т. д.
$x=988;

if (($x % 2==0))
{
    echo 'четное число';
}
elseif (($x % 2 !=0 ))
{
    echo  'нечетное число';
}