<?php
//Вычислить периметр и площадь прямоугольника если вторая сторона в 4 раза больше первой (первую сторону придумать самому)
//$side1=10;
//$side2=$side1*4;
//$perimeter=$side1*2+$side2*2;
//$area=$side1*$side2;
//echo "периметр : $perimeter";
//echo "<br> площадь : $area";

//Дано два числа. Вывести значение результата в логической переменной, которое определяет,
//  отличаются ли первое от второго на 10.(ответ true или false)

//$one=2;
//$two=7;
//
//if ($two!=$one+10)
//    var_dump(false);
//
//else
//    var_dump(true);

//Даны три числа. Найдите их среднее арифметическое, умножить его на 4 и сравнить с каждым из чисел.
//(ответ true или false + сами числа)
//$first=4;
//$second=13;
//$third=27;
//$average=($first+$second+$third)/3;
//$mult=$average*4;
//echo " среднее арифметическое : $average ";
//echo "<br> среднее арифметическое*4 : $mult ";
//
// switch ($comparison)
//{case $mult=$first or $second or $third:
//   echo"<br>"; var_dump(true);
//    default: echo"<br>";var_dump(false);
//        break;}

//Дано число. Увеличьте его на 30%, на 120% и сравнить среднее арифметическое
//результатов с первоначальным числом  (ответ true или false + сами числа)
//$a1=50;
//$a2=$a1*(1+30/100);
//$a3=$a1*(1+120/100);
//$average=($a1+$a2+$a3)/3;
//if ($average!=$a1)
//    var_dump(false);
//else
//    var_dump(true);
//echo "<br> число > на 30 % : $a2  число > на 120% : $a3 среднее арифметическое : $average";

// Найти сумму квадратов  36% от первого числа и 87% от второго числа
//$a1=50;
//$percent1=$a1*(1+36/100);
//$a2=66;
//$percent2=$a1*(1+87/100);
//$sum=$percent1**2+2*$percent1*$percent2+$percent2**2;
//echo $sum;

// Дано трехзначное число. Найдите сумму его цифр
//$a1='987';
//echo $sum=$a1[0]+$a1[1]+$a1[2];

//В сплаве 23% железа 17% олова и 60% меди . Сплав весит 571 кг .
//Найти массовую долю каждого компонента
//$alloy=571;
//$iron=$alloy*23/100;
//$tin=$alloy*17/100;
//$copper=$alloy*60/100;
//
//echo "масса железа :$iron масса олова : $tin масса меди : $copper";

//Вычислить массовую долю соли в 3% растворе массой 36 кг
//$aqua=36;
//$salt=$aqua*23/100;
//echo $salt;

//Возьмите свой вес , посчитайте с какой силой вас притягивает земля(вес умножить на 10 ньютон на килограмм) и с какой
// силой вам надо оттолкнуться от земли чтобы подпрыгнуть(сила притяжения земли + X ньютон (взять любое число больше 300))

//$weight=79;
//$gravitation=$weight*10;
//$jump=$gravitation+310;
//echo "земля притягивает меня с силой : $gravitation";
//echo "<br> что бы подпрыгнуть нужна сила : $jump";

